<template>
  <div class="houses-list">
    <appContentActions :btns="['Добавить дом', 'Добавить помещение']" />
    <div class="houses-list-table">
      <table class="table">
        <thead>
          <tr>
            <th>№ п/п</th>
            <th>Адрес</th>
            <th>Площадь</th>
            <th>Год постройки</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td>1.</td>
            <td>612260, обл Кировская, р-н Яранский, г Яранск, ул Строительная, д. 9</td>
            <td>4350,73 м.кв</td>
            <td>1985 г.</td>
          </tr>
          <tr>
            <td>1.</td>
            <td>612260, обл Кировская, р-н Яранский, г Яранск, ул Строительная, д. 9</td>
            <td>4350,73 м.кв</td>
            <td>1985 г.</td>
          </tr>
          <tr>
            <td>1.</td>
            <td>612260, обл Кировская, р-н Яранский, г Яранск, ул Строительная, д. 9</td>
            <td>4350,73 м.кв</td>
            <td>1985 г.</td>
          </tr>
          <tr>
            <td>1.</td>
            <td>612260, обл Кировская, р-н Яранский, г Яранск, ул Строительная, д. 9</td>
            <td>4350,73 м.кв</td>
            <td>1985 г.</td>
          </tr>
          <tr>
            <td>1.</td>
            <td>612260, обл Кировская, р-н Яранский, г Яранск, ул Строительная, д. 9</td>
            <td>4350,73 м.кв</td>
            <td>1985 г.</td>
          </tr>
          <tr>
            <td>1.</td>
            <td>612260, обл Кировская, р-н Яранский, г Яранск, ул Строительная, д. 9</td>
            <td>4350,73 м.кв</td>
            <td>1985 г.</td>
          </tr>
          <tr>
            <td>1.</td>
            <td>612260, обл Кировская, р-н Яранский, г Яранск, ул Строительная, д. 9</td>
            <td>4350,73 м.кв</td>
            <td>1985 г.</td>
          </tr>
          <tr>
            <td>1.</td>
            <td>612260, обл Кировская, р-н Яранский, г Яранск, ул Строительная, д. 9</td>
            <td>4350,73 м.кв</td>
            <td>1985 г.</td>
          </tr>
          <tr>
            <td>1.</td>
            <td>612260, обл Кировская, р-н Яранский, г Яранск, ул Строительная, д. 9</td>
            <td>4350,73 м.кв</td>
            <td>1985 г.</td>
          </tr>
          <tr>
            <td>1.</td>
            <td>612260, обл Кировская, р-н Яранский, г Яранск, ул Строительная, д. 9</td>
            <td>4350,73 м.кв</td>
            <td>1985 г.</td>
          </tr>
          <tr>
            <td>1.</td>
            <td>612260, обл Кировская, р-н Яранский, г Яранск, ул Строительная, д. 9</td>
            <td>4350,73 м.кв</td>
            <td>1985 г.</td>
          </tr>
          <tr>
            <td>1.</td>
            <td>612260, обл Кировская, р-н Яранский, г Яранск, ул Строительная, д. 9</td>
            <td>4350,73 м.кв</td>
            <td>1985 г.</td>
          </tr>
          <tr>
            <td>1.</td>
            <td>612260, обл Кировская, р-н Яранский, г Яранск, ул Строительная, д. 9</td>
            <td>4350,73 м.кв</td>
            <td>1985 г.</td>
          </tr>
          <tr>
            <td>1.</td>
            <td>612260, обл Кировская, р-н Яранский, г Яранск, ул Строительная, д. 9</td>
            <td>4350,73 м.кв</td>
            <td>1985 г.</td>
          </tr>
          <tr>
            <td>1.</td>
            <td>612260, обл Кировская, р-н Яранский, г Яранск, ул Строительная, д. 9</td>
            <td>4350,73 м.кв</td>
            <td>1985 г.</td>
          </tr>
        </tbody>
      </table>
    </div>
  </div>
</template>
<script>
import appContentActions from '../components/appContentActions';
export default {
  components: {
    appContentActions,
  },
};
</script>
